Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་གཟུགས་མཆོག་གྲོང་ཁྱེར་སྲུང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་བཟང་པོ་ལ། །བཏུང་བ་བྱིན་གྱིས་བརླབས་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śreṣṭharūpa, when a city guard, Offered a consecrated drink To the thus-gone Excellent Moon And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྐར་མཁན་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ངེས་པའི་གཟུགས་དེ་ལ། །སྤོས་ཀྱི་རྒྱུ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Jyotiṣka, when an incense merchant, Offered incense substances To the thus-gone Certain Form And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་བའི་སྒྲོན་མ་སློངས་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣལ་འབྱོར་སེམས་དཔའ་ལ། །འགྲོན་བུ་ཉི་ཤུ་དག་ནི་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Candrapradīpa, when a female beggar, Scattered twenty cowries Before the thus-gone Being of Spiritual Training And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་ཕུང་པོ་རྩྭ་ཐུན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟབ་མོར་གནས་དེ་ལ། །རྩྭ་ལས་བྱས་པའི་གདུགས་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Tejorāśi, when a straw collector, Offered a straw parasol To the thus-gone Profound Abiding And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བྱང་ཆུབ་རྒྱལ་པོ་ཤིང་རྟ་ཡི། །མཁན་ཚེ་དེ་བཞིན་གཤེགས་པ་དཔལ་འོད་ལ། །ཤིང་རྟ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bodhirāja, when a chariot maker, Offered chariots To the thus-gone Glorious Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་ཟད་ཤིང་རྟ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་གདུལ་དཀའ་ལ། །བཞུགས་ཁྲིའུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Akṣaya, when a chariot maker, Offered thrones To the thus-gone Very Hard to Tame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མངོན་རྟོགས་སྤྱན་ནི་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་དུ་གཟིགས་དེ་ལ། །བལྡག་སྨན་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Subuddhinetra, when a physician, Offered medicinal lozenges To the thus-gone Universal Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡན་ལག་རྒྱས་པ་ཕྱུགས་རྫིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་སྒྲོན་དེ་ལ། །ལྷུང་བཟེད་དར་བས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pūritāṅga, when a cattle herder, Offered an alms bowl filled with buttermilk To the thus-gone Moon Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡུལ་འཁོར་ཤེས་རབ་མར་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བའི་དཔལ་དེ་ལ། །ཞུན་མར་སྲང་བརྒྱད་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prajñārāṣṭra, when a butter merchant, Offered eight measures of clarified butter To the thus-gone Glory of Clarity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཆོག་ནི་བོང་རྫིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་གདུགས་དེ་ལ། །བཞུགས་པའི་རྡོ་གདན་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Uttama, when a donkey herder, Offered a stone seat To the thus-gone Moon Parasol And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་ཚིམ་མཛད་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འགྲོ་བའི་མུ་སྟེགས་ལ། །སེའུ་འབྲུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Toṣitatejas, when a prince, Offered pomegranates To the thus-gone Steps for Wandering Beings And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་རབ་བྱིན་ནི་མར་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བའི་དཔལ་དེ་ལ། །མར་ཁུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prajñādatta, when a butter merchant, Offered clarified butter To the thus-gone Glory of Clarity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འཇམ་དབྱངས་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཆོག་དེ་ལ། །རིལ་བ་ཆུ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Mañjughoṣa, when a potter, Offered a jar filled with water To the thus-gone Supreme Jewel And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མགོན་པོ་རིགས་བུའི་ཚེ། །བདེ་གཤེགས་བཟང་པོ་ངོ་ཚ་མཁྱེན་པ་ལ། །འཆག་ས་དག་ནི་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Nātha, when a young family man, Made and offered a monastic walkway Before the well-gone Excellent Knower of Modesty And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆགས་མེད་མཛོད་ནི་མི་བཀྲེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བལྟ་བར་བཟོད་དེ་ལ། །ཚོད་མའི་ཀོང་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Asaṅgakośa, when a destitute, Offered a basket of vegetables To the thus-gone Bearing Seeing And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཙོ་བོས་བྱིན་ནི་ལྷ་ཡི་བུ། །དབང་ཕྱུག་ཆེ་ཚེ་དེ་བཞིན་གཤེགས་པ་པོ། །སེང་གེའི་ང་རོ་དེ་ལ་བསྟོད་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jyeṣṭhadatta, when a divine son of great power, Offered praises To the thus-gone Lion’s Roar And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གཙོ་བོ་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་ཆེན་པོ་ལ། །སྤོས་ལོའི་རིལ་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śreṣṭha, when an incense merchant, Offered balls made of fragrant leaves To the thus-gone Great PowerAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་མཐུ་རྩལ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གསལ་དེ་ལ། །ཀོ་བི་ད་རའི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānavikrama, when a forest guard, Offered kovidāra flowers To the thus-gone Universal Clarity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འོད་འཕྲོ་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱངས་ཀྱི་སྣོད་དེ་ལ། །བུ་རམ་ཆུ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Arciṣmat, when a monk, Offered sugarcane juice To the thus-gone Melody Vessel And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དབང་པོ་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགའ་བའི་དཔལ་དེ་ལ། །སྐྱེད་མོས་ཚལ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Indra, when a householder, Offered pleasure gardens To the thus-gone Glory of Joy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤུགས་འཆང་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཉམ་པར་གནས་པ་པོ། །དེ་ལ་གདུགས་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vegadhārin, when the son of a merchant, Offered parasols To the thus-gone Abiding in Equanimity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྐར་རྒྱལ་འཁོར་ལོས་སྒྱུར་བའི་ཚེ། །བདེ་གཤེགས་ཀུན་གྱི་བློ་དེ་འཁོར་བཅས་ཐེར་འབུམ་དག །དབྱར་གནས་ཚེ་ན་ཕོངས་པ་མེད་པས་སྤྱན་དྲངས་ནས། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Tiṣya, when a universal monarch, Invited the well-gone Universal Mind and his billionfold retinue For the rains retreat without sparing anything, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འོད་བཟང་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་ཆེན་པོ་ལ། །སྦྲང་རྩི་ཅི་བཞེད་པ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Suprabha, when a merchant, Offered as much honey as would be accepted To the thus-gone Great Power And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲགས་བྱིན་འཛམ་གླིང་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་ཏོག་དེ་ཡི། །གཙུག་ལག་ཁང་ནི་བྱེ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Yaśodatta, when a king of Jambudvīpa, Constructed ten million monastic temples Before the thus-gone Moon Crest And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གཟུགས་བཟང་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་བརྟན་དེ་ལ། །སྤོས་ནི་སྲང་གི་བཞི་ཆ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Surūpa, when an incense merchant, Offered four measures of incense To the thus-gone Steadfast Yogic Discipline And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྒྱལ་པོ་གསེར་རྟོག་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡིས་མཆོད་དེ་ལ། །ཁྲོན་པ་ཟླུམ་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Rājan, when a gold dealer, Offered a round well To the thus-gone Worshiped by Gods And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐལ་བར་རློག་དེ་ལ། །མཆོད་སྦྱིན་ཆེན་པོ་དག་ནི་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Arthasiddhi, when a brahmin, Performed great sacrificial worship For the thus-gone Pulverizing And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་སྡེ་ནི་དབང་བློན་གྱི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་གྲགས་མཆོག་ལ། །སྐྱེད་མོས་ཚལ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhasena, when the son of a judge, Offered pleasure gardens To the thus-gone Supreme Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ནོར་ལྷའི་བུ་ནི་ཚོང་དཔོན་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་རྫོགས་པ་པོ། །དེ་ལ་ཞབས་བཀྲུ་བ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vāsava, when the daughter of a merchant, Offered a footbath To the thus-gone Perfecter of All Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲགས་པ་རྒྱལ་པོའི་བཙུན་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་བརྟན་དེ་ལ་ནི། །རང་གི་རྒྱན་རྣམས་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Yaśas, when a queen, Scattered her own ornaments Before the thus-gone Stable Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱལ་བ་རྒྱལ་པོའི་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་འོད་ཟེར་ཅན། །དེ་ལ་ཐོད་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jaya, when a princess, Offered her crown To the thus-gone Nectar Radiance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱ་ཆེན་སྙིང་པོ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱངས་ཆེན་དེ་ལ་ནི། །མུ་ཏིག་དག་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Udāragarbha, when a merchant, Offered a parasol made of pearls To the thus-gone Great Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་འོད་ཟེར་ལྕགས་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་དབྱངས་གསལ་དེ་ལ་ནི། །སོག་མ་དག་ལས་བྱས་པའི་ཕྲེང་བ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyaraśmi, when a guard of an ironworks, Offered a garland of straw To the thus-gone Clear Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྨྲང་འདོན་འབྲུ་མར་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོབས་ཆེན་དེ་ལ་ནི། །ལྷུང་བཟེད་འབྲུ་མར་དག་གིས་བཀང་བ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śrotriya, when an oil producer, Offered an alms bowl filled with oil To the thus-gone Great Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲོན་རྒྱལ་རྩིས་པའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་ཆེན་པོ་ལ། །མེ་ཏོག་འབྲས་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pradīparāja, when the son of an astrologer, Offered flowers and fruits To the thus-gone Great Power And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་བརྩེགས་ནི་ལྗོངས་དག་གི། །ཕོ་ཉ་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་པོ། །བདུད་རྩི་གསལ་ལ་སྦྲང་རྩིའི་བཏུང་བ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānakūṭa, when a head messenger of a province, Offered a honey drink To the thus-gone Luminous Nectar And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་མཆོག་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་མཐུ་རྩལ་ལ། །མ་ཏུ་ལུང་ག་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Uttamadeva, when a forest guard, Offered a medicine of lime To the thus-gone Power of Awakening And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ས་བདག་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྒྲ་མཆོག་སེམས་པ་ལ། །ཁང་བརྩེགས་གོས་ཀྱིས་གཡོགས་པ་དག་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Pārthiva, when a householder, Offered a multistoried mansion draped in fabrics To the thus-gone Intent on Supreme Sound And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲོལ་བརྙེས་བཙོ་བླག་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་དྲག་ཤུལ་ལ། །རས་ཡུག་ཁྲ་བོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vimuktilābhin, when a washerman, Offered a multicolored cotton cloth To the thus-gone Fierce Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཙུག་གསེར་ཚོང་དཔོན་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆུ་ལྷའི་མཐུ་རྩལ་ལ། །གསེར་གྱི་བུམ་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suvarṇacūḍa, when a young merchant, Offered golden jars To the thus-gone Power of the Water God And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་གཅན་བཟང་པོ་སློང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་ཆེན་པོ་ལ། །རྩྭ་ཡི་སྒྲོན་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhubhadra, when a beggar, Offered a lamp made from straw To the thus-gone Great Yogic Discipline And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐུབ་དཀའ་གོ་རི་ཀ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་འབར་བ་ཡི། །གཤེགས་ཟམ་དག་ནི་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Durjaya, when a gorika, Constructed a bridge and offered it To the thus-gone Blazing Light Rays And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཐུབ་གསལ་དུང་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉོན་མོངས་མེད་བློ་ལ། །དུང་དག་སྤར་བ་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Muniprasanna, when a conch seller, Offered a handful of conches To the thus-gone Mind Free from Defilements And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་བའི་འོད་ཟེར་ཚོང་དུས་པའི། །ཁྱེའུའི་ཚེ་བདེ་གཤེགས་སེང་གེའི་དབྱངས་དེ་ལ། །ཁམ་ཕོར་མར་ཁུས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Somaraśmi, when a young market merchant, Offered a clay bowl filled with clarified butter To the well-gone Lion Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གསེར་འོད་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་དགྱེས་དེ་ལ། །མུ་ཏིག་ཆུན་ཕྲེང་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kāñcanaprabha, when the son of a merchant, Offered pearl garlands To the thus-gone Tremendous Delight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཡི་ཡོན་ཏན་དབང་པོ་བློན་ཆེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་རབ་ཏུ་གནས་པ་ལ། །དཔག་ཚད་གཅིག་པའི་སྐྱེད་མོས་ཚལ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇendradeva, when a chief minister, Offered a one-league-large pleasure garden To the thus-gone Excellent Abiding And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་གདུགས་བྲམ་ཟེའི་ཚེ། །རི་ཡི་རྩེ་མོ་ནས་ནི་བདག་མཆོངས་ནས། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dharmacchattra, when a brahmin, Jumped from a mountaintop Before the thus-gone Sunlight, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་ལག་ནི་ཚོང་དཔོན་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་སྒྲོན་མ་དེ་ལ་ནི། །མེ་ཏོག་མྱ་ངན་འཚང་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyabāhu, when the daughter of a merchant, Offered aśoka flowers To the thus-gone Nectar Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆགས་མེད་སྤོས་འཚོང་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སྟབས་དེ་ལ། །སྲན་གྲེའུ་ཕུལ་གསུམ་ཞིག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Asaṅga, when a young incense merchant, Presented three offerings of māṣa beans To the thus-gone Force of Awakening And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་གྱ་ནོམ་རྒྱལ་པོ་ཡི། །ཕོ་ཉའི་ཚེ་ན་བདེ་གཤེགས་རྒྱལ་བ་ཡི། །བཤེས་གཉེན་དེ་ལ་ལན་ཅིག་བསྐོར་བྱས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prāṇītajñāna, when a royal messenger, Performed one circumambulation Of the well-gone Victorious Friend And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་ཞིབ་རྒྱལ་པོའི་བཙུན་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་གཟིགས་དེ་ལ། །བུམ་པ་ཆུ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūkṣmabuddhi, when a queen, Offered a jar filled with water To the thus-gone Excellent Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བྱིན་ཐམས་ཅད་དེད་དཔོན་ཚེ། །དགེ་འདུན་མང་པོར་ཞལ་ཟས་གསོལ་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་རྙོག་པ་མེད་དོན་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sarvatejas, when a captain, Offered meals for numerous members of the saṅgha To the thus-gone Unsullied Objective And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྩི་སྨན་ལག་བླའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྟོགས་པའི་མཆོག་དེ་ལ། །སྐྱུ་རུ་ར་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Oṣadhi, when a supervisor of a new building, Offered myrobalan fruits To the thus-gone Supreme Realization And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་གྲོལ་ཏོག་ནི་རྟེན་བཅས་ཚེ། །འདམ་རྫབ་དག་ཏུ་ཟམ་པ་བཙུགས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་མི་ཡི་ཟླ་བ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vimuktaketu, when having a single support, Built a bridge across a swamp For the thus-gone Moon of Humanity, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འོད་མཛོད་ཞིང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་འབར་དེ་ལ་ནི། །མེ་ཏོག་དམར་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Prabhākośa, when a farmer, Offered red flowers To the thus-gone Blazing Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་རྒྱལ་པོ་འབྲས་ས་ལུ། །ཁུར་ཁྱེར་ཚེ་ན་བདེ་གཤེགས་ཀུན་འོད་ལ། །མེ་ཏོག་ཀར་ནི་ཀ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānarāja, when a rice porter, Offered karṇikā flowers To the well-gone Universal Light And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འཇིགས་མཛད་དཔའ་བོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་ཆེན་པོ་ལ། །རྒྱལ་མཚན་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Bhīṣaṇa, when a hero, Offered banners To the thus-gone Great Array And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆུ་བོ་སྤོང་ནི་གྲོང་རྡལ་བྱིས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་རྣམ་པར་བསྒྱིངས་པ་ཡི། །སྟོབས་ལ་མེ་ཏོག་ཨུད་པལ་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Oghajaha, when a child in a village, Offered utpala flowers To the thus-gone Strength of a Striding Lion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐོགས་མེད་གྲགས་པ་སློང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་དགའ་དེ་ལ་ནི། །མོ་ཙ་ན་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Asaṅgakīrti, when a beggar, Offered mocana plants To the thus-gone Divine Joy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདེན་པའི་ཕུང་པོ་ཆང་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་རི་དབང་མཚུངས་དེ་ལ། །རྫ་རྔ་དང་ནི་ལོ་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Satyarāśi, when an alcohol vendor, Offered an earthen drum and leaves To the thus-gone Equal of the King of Mountains And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་སྙན་རྩྭ་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟབས་ཆེན་དེ་ལ་ནི། །རྩྭ་སྤྱིལ་དག་ནི་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Susvara, when a grass seller, Build grass huts and offered them For the thus-gone Great Strength And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རི་དབང་མཚུངས་ནི་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་དུ་འོང་བའི་དབྱངས། །དེ་ལ་གདུགས་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Girīndrakalpa, when a prince, Offered parasols To the thus-gone Delightful Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་བརྩེགས་ལྷ་ཡི་བསྙེན་བཀུར་བ། །བྱེད་ཚེ་བདེ་གཤེགས་བསོད་ནམས་བརྩེགས་པ་ལ། །མེ་ཏོག་ཆང་པ་གང་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmakūṭa, when a worshiper of a god, Offered a bouquet of flowers To the well-gone Compiled Merit And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐར་པའི་གཟི་བརྗིད་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ནོར་བུ་ཟླ་བ་ལ། །ཙུག་ཀྲ་རུ་ཀའི་འབྲས་བུ་བརྒྱད་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mokṣatejas, when a prince, Offered eight cukraruka fruits To the thus-gone Jewel Moon And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་མཛད་གར་མཁན་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྱན་སྡུག་དེ་ལ་ནི། །རས་བལ་དག་གི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śobhita, when the daughter of a dancer, Offered garlands made of cotton wool To the thus-gone Lovely Eyes And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རབ་ཞི་སྐུ་ནི་འཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྙན་པར་གྲགས་དེ་ལ། །ཙམ་པ་ཀ་ཡི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Praśāntagātra, when a garland maker, Offered a garland of campaka flowers To the thus-gone Renown And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡིད་འོང་གསུང་ནི་དམག་མིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བའི་དཔལ་དེ་ལ། །རས་ཡུག་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Manojñavākya, when a soldier, Offered a length of cotton fabric To the thus-gone Glory of Clarity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བློ་སྦྱངས་སྨན་པའི་ཚེ། །བདེ་གཤེགས་སེང་གེའི་མཆེ་བ་དགོངས་མལ་དུ། །འབྲུ་མར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Cīrṇabuddhi, when a physician, Offered grain oil in the evening To the well-gone Lion Fangs And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆུ་ལྷ་གདུགས་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཆོད་འོས་ལ། །དུས་སུ་བསིལ་ཡབ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Varuṇa, when a parasol maker, Offered timely fanning To the thus-gone Jewel Worthy of Worship And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་ལོགས་ནི་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དྲི་ཞིམ་འོད་དེ་ལ། །སྟོན་མོ་ཆེན་མོ་དག་ནི་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhapārśva, when a captain, Offered a celebratory banquet To the thus-gone Fragrant Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་མཐུ་རྩལ་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་ཞིར་གྱུར་པ་ལ། །དངུལ་ལས་བྱས་པའི་གདན་ཁྲི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmavikrāmin, when a prince, Offered a throne of silver To the thus-gone Pacifier of Enemies And in doing so first gave rise to the mind of awakening.
